# DBeam_SetShow3DType

```pascal
PROCEDURE DBeam_SetShow3DType(typeFlag : INTEGER);
```

```python
def vs.DBeam_SetShow3DType(typeFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|typeFlag|INTEGER|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight